linuxhelp01/Esp32_paletizador/src/machine.cpp
#include "machine.h"

#include "config.h"
#include "mks_can.h"

#if ENABLE_MICRO_ROS
struct NullDebugSerial {
  template <typename... Args>
  void print(Args...) {}

  template <typename... Args>
  void println(Args...) {}
};

static NullDebugSerial DebugSerial;
#else
#define DebugSerial Serial
#endif

MotorNode motors[ROBOT_MOTOR_COUNT] = {
  MotorNode("X1", CAN_ID_PHYSICAL_Y1, MOTOR_DIR_PHYSICAL_Y1),
  MotorNode("X2", CAN_ID_PHYSICAL_Y2, MOTOR_DIR_PHYSICAL_Y2),
  MotorNode("Y", CAN_ID_PHYSICAL_X, MOTOR_DIR_PHYSICAL_X),
  MotorNode("Z", CAN_ID_Z, MOTOR_DIR_Z),
  MotorNode("A", CAN_ID_A, MOTOR_DIR_A, true),
};

static uint32_t lastEncoderPollMs = 0;
static uint32_t lastSpeedPollMs = 0;
static uint32_t lastRawEncoderPollMs = 0;
static uint32_t lastAngleErrorPollMs = 0;
static uint32_t lastHomeStatusPollMs = 0;
static uint32_t lastEnableStatusPollMs = 0;
static uint32_t lastStallStatusPollMs = 0;
static uint32_t encoderPollingPausedUntilMs = 0;
static uint8_t nextEncoderPollMotor = 0;
static uint8_t nextSpeedPollMotor = 0;
static uint8_t nextRawEncoderPollMotor = 0;
static uint8_t nextAngleErrorPollMotor = 0;
static uint8_t nextEnablePollMotor = 0;
static uint8_t nextStallPollMotor = 0;
static bool safetyFaultActive = false;
static const char *safetyFaultReason = "OK";
static bool xPairMotionMonitoringActive = false;
static int8_t xPairExpectedDirection = 0;

static bool commandStopAll();

struct AxisLimitState {
  bool configured = false;
  float minMm = 0.0f;
  float maxMm = 0.0f;
};

enum class HomingPhase : uint8_t {
  IDLE,
  CONFIG_FAST,
  START_FAST,
  WAIT_FAST,
  CONFIG_SLOW,
  START_SLOW,
  WAIT_SLOW,
  COMPLETE,
  FAILED,
};

struct HomingSequenceState {
  bool active = false;
  Axis requestedAxis = Axis::UNKNOWN;
  Axis axes[4] = {Axis::UNKNOWN, Axis::UNKNOWN, Axis::UNKNOWN, Axis::UNKNOWN};
  uint8_t axisCount = 0;
  uint8_t axisIndex = 0;
  HomingPhase phase = HomingPhase::IDLE;
  uint16_t fastRpm = HOME_FAST_RPM;
  uint16_t slowRpm = HOME_SLOW_RPM;
  uint32_t phaseStartedMs = 0;
  bool configureLimits = false;
  float limitMinMm = 0.0f;
  float limitMaxMm = 0.0f;
  char stateText[48] = "idle";
};

static AxisLimitState axisLimits[ROBOT_LINEAR_AXIS_COUNT];
static HomingSequenceState homing;
static bool auxServoEnabled = false;
static uint16_t auxServoPulseUs = AUX_SERVO_CENTER_US;
static float auxServoAngleDeg = 90.0f;

static String nextToken(String &line) {
  line.trim();
  const int idx = line.indexOf(' ');
  if (idx < 0) {
    String token = line;
    line = "";
    token.trim();
    return token;
  }

  String token = line.substring(0, idx);
  line = line.substring(idx + 1);
  token.trim();
  return token;
}

static int8_t axisLimitIndex(Axis axis) {
  switch (axis) {
    case Axis::X:
      return 0;
    case Axis::Y:
      return 1;
    case Axis::Z:
      return 2;
    default:
      return -1;
  }
}

static Axis currentHomingAxis() {
  if (!homing.active || homing.axisIndex >= homing.axisCount) return Axis::UNKNOWN;
  return homing.axes[homing.axisIndex];
}

static const char *axisName(Axis axis) {
  switch (axis) {
    case Axis::X:
      return "X";
    case Axis::X1:
      return "X1";
    case Axis::X2:
      return "X2";
    case Axis::Y:
      return "Y";
    case Axis::Z:
      return "Z";
    case Axis::A:
      return "A";
    case Axis::ALL:
      return "ALL";
    default:
      return "?";
  }
}

static uint8_t motorIndex(const MotorNode &motor) {
  for (uint8_t i = 0; i < ROBOT_MOTOR_COUNT; i++) {
    if (&motors[i] == &motor) return i;
  }
  return 0;
}

static uint8_t homeDirectionForMotor(const MotorNode &motor) {
  switch (motorIndex(motor)) {
    case 0:
      return HOME_DIRECTION_X1;
    case 1:
      return HOME_DIRECTION_X2;
    case 2:
      return HOME_DIRECTION_Y;
    case 3:
      return HOME_DIRECTION_Z;
    default:
      return HOME_DIRECTION_A;
  }
}

static MotorNode *findMotorById(uint16_t canId) {
  for (MotorNode &motor : motors) {
    if (motor.canId == canId) return &motor;
  }
  return nullptr;
}

static int32_t toMotorTarget(const MotorNode &motor, int32_t robotTarget) {
  return robotTarget * motor.direction;
}

static int32_t toMotorSpeed(const MotorNode &motor, int32_t robotRpm) {
  return robotRpm * motor.direction;
}

static void pauseEncoderPolling() {
  encoderPollingPausedUntilMs = millis() + MOTION_COMMAND_POLL_PAUSE_MS;
}

static bool sendDriverCommand(uint16_t canId, const uint8_t *cmd, uint8_t len) {
  pauseEncoderPolling();
  mks::waitTxIdle(5);
  for (uint8_t attempt = 0; attempt < CAN_COMMAND_TX_RETRIES; attempt++) {
    if (mks::sendFrame(canId, cmd, len)) return true;
    drainCanReplies();
    mks::waitTxIdle(2);
    delay(1);
  }
  return false;
}

static bool sendTelemetryRequest(uint16_t canId, const uint8_t *cmd, uint8_t len) {
  return mks::sendFrame(canId, cmd, len, CAN_TELEMETRY_TX_TIMEOUT_MS);
}

static int8_t signOfDelta(int64_t value) {
  if (value > 0) return 1;
  if (value < 0) return -1;
  return 0;
}

static void setSafetyFault(const char *reason) {
  if (!safetyFaultActive) {
    DebugSerial.print("SAFETY FAULT: ");
    DebugSerial.println(reason);
  }
  safetyFaultActive = true;
  safetyFaultReason = reason;
  xPairMotionMonitoringActive = false;
  xPairExpectedDirection = 0;
  commandStopAll();
}

static bool xPairSamplesCloseEnough(bool report) {
  const MotorNode &x1 = motors[0];
  const MotorNode &x2 = motors[1];
  const uint32_t skewMs = x1.lastEncoderUpdateMs > x2.lastEncoderUpdateMs
                              ? x1.lastEncoderUpdateMs - x2.lastEncoderUpdateMs
                              : x2.lastEncoderUpdateMs - x1.lastEncoderUpdateMs;
  if (skewMs <= X_PAIR_ALIGNMENT_SAMPLE_SKEW_MS) return true;
  if (report) {
    DebugSerial.print("X ERROR: muestras X1/X2 no sincronizadas, skewMs=");
    DebugSerial.println(skewMs);
  }
  return false;
}

static bool isXPairAligned(bool requireFreshSamples = false) {
  const MotorNode &x1 = motors[0];
  const MotorNode &x2 = motors[1];
  if (!x1.encoderOk || !x2.encoderOk) {
    DebugSerial.println("X ERROR: falta lectura de encoder en X1 o X2");
    commandStopAll();
    return false;
  }

  if (requireFreshSamples && !xPairSamplesCloseEnough(true)) {
    commandStopAll();
    return false;
  }

  const int64_t error = x1.encoder - x2.encoder;
  if (llabs(error) > X_PAIR_MAX_ERROR_COUNTS) {
    DebugSerial.print("X ERROR: X1/X2 desalineados, errorEnc=");
    DebugSerial.print(error);
    DebugSerial.print(" errorMm=");
    DebugSerial.println(encoderCountsToMm(error), 3);
    commandStopAll();
    return false;
  }

