linuxhelp01/Esp32_paletizador/src/machine.cpp
  return true;
}

static bool safetyAllowsMotion() {
  if (!safetyFaultActive) return true;
  DebugSerial.print("SAFETY ERROR: falla activa, ejecute FAULT RESET. motivo=");
  DebugSerial.println(safetyFaultReason);
  commandStopAll();
  return false;
}

static bool setAxisLimits(Axis axis, float minMm, float maxMm) {
  const int8_t index = axisLimitIndex(axis);
  if (index < 0 || !(minMm < maxMm)) return false;

  axisLimits[index].configured = true;
  axisLimits[index].minMm = minMm;
  axisLimits[index].maxMm = maxMm;
  return true;
}

bool getAxisLimits(Axis axis, float &minMm, float &maxMm) {
  const int8_t index = axisLimitIndex(axis);
  if (index < 0) return false;

  minMm = axisLimits[index].minMm;
  maxMm = axisLimits[index].maxMm;
  return axisLimits[index].configured;
}

bool axisLimitsAreConfigured(Axis axis) {
  const int8_t index = axisLimitIndex(axis);
  return index >= 0 && axisLimits[index].configured;
}

static bool targetWithinSoftwareLimits(Axis axis, float targetMm) {
  const int8_t index = axisLimitIndex(axis);
  if (index < 0) return false;
  if (!axisLimits[index].configured) return true;
  return targetMm >= axisLimits[index].minMm && targetMm <= axisLimits[index].maxMm;
}

static bool xyzWithinSoftwareLimits(float xMm, float yMm, float zMm) {
  return targetWithinSoftwareLimits(Axis::X, xMm) &&
         targetWithinSoftwareLimits(Axis::Y, yMm) &&
         targetWithinSoftwareLimits(Axis::Z, zMm);
}

static bool motorIsCommandable(const MotorNode &motor) {
  if (!motor.enabledOk || !motor.enabled) return false;
  if (motor.stallOk && motor.stalled) return false;
  return true;
}

static bool axisIsEnabledAndClear(Axis axis) {
  return forEachMotorInAxis(axis, [](MotorNode &motor) {
    return motorIsCommandable(motor);
  });
}

static bool axisIsSafeForMotion(Axis axis) {
  if (!safetyAllowsMotion()) return false;
  if (axis == Axis::X1 || axis == Axis::X2) {
    DebugSerial.println("X ERROR: X1 y X2 no se mueven por separado. Usa eje X.");
    return false;
  }
  if (axis == Axis::X) return isXPairAligned();
  return axis == Axis::Y || axis == Axis::Z || axis == Axis::A || axis == Axis::ALL;
}

static void setXPairExpectedDirectionFromSpeed(int32_t rpm) {
  xPairMotionMonitoringActive = true;
  xPairExpectedDirection = signOfDelta(rpm);
}

static void setXPairExpectedDirectionFromTarget(int32_t target) {
  xPairMotionMonitoringActive = true;
  const MotorNode &x1 = motors[0];
  const MotorNode &x2 = motors[1];
  if (!x1.encoderOk || !x2.encoderOk) {
    xPairExpectedDirection = 0;
    return;
  }

  const int64_t average = (x1.encoder + x2.encoder) / 2;
  const int64_t delta = static_cast<int64_t>(target) - average;
  xPairExpectedDirection = signOfDelta(delta);
}

static void clearXPairExpectedDirectionIfAxis(Axis axis) {
  if (axis == Axis::X) {
    xPairMotionMonitoringActive = false;
    xPairExpectedDirection = 0;
  }
}

static void verifyXPairDirectionSafety() {
  if (safetyFaultActive || !xPairMotionMonitoringActive) return;
  const MotorNode &x1 = motors[0];
  const MotorNode &x2 = motors[1];
  if (!x1.encoderOk || !x2.encoderOk) return;
  if (!xPairSamplesCloseEnough(false)) return;
  
  if (!isXPairAligned()) {
    setSafetyFault("X1/X2 fuera de alineacion");
    return;
  }

  const int64_t delta1 = x1.encoder - x1.previousEncoder;
  const int64_t delta2 = x2.encoder - x2.previousEncoder;
  const bool x1Moved = llabs(delta1) >= X_PAIR_DIRECTION_MIN_DELTA_COUNTS;
  const bool x2Moved = llabs(delta2) >= X_PAIR_DIRECTION_MIN_DELTA_COUNTS;
  const int8_t dir1 = signOfDelta(delta1);
  const int8_t dir2 = signOfDelta(delta2);

  if (x1Moved && x2Moved && dir1 != dir2) {
    setSafetyFault("X1/X2 se mueven en sentidos opuestos");
    return;
  }

  if (xPairExpectedDirection != 0 &&
      ((x1Moved && dir1 != xPairExpectedDirection) || (x2Moved && dir2 != xPairExpectedDirection))) {
    setSafetyFault("eje X doble se mueve contra el sentido comandado");
  }
}

static bool resetSafetyFault() {
  commandStopAll();
  xPairMotionMonitoringActive = false;
  xPairExpectedDirection = 0;
  if (!isXPairAligned()) return false;

  safetyFaultActive = false;
  safetyFaultReason = "OK";
  DebugSerial.println("SAFETY RESET OK: falla liberada, funcionamiento normal habilitado.");
  return true;
}

Axis parseAxis(String token) {
  token.trim();
  token.toUpperCase();
  if (token == "X") return Axis::X;
  if (token == "X1") return Axis::X1;
  if (token == "X2") return Axis::X2;
  if (token == "Y") return Axis::Y;
  if (token == "Z") return Axis::Z;
  if (token == "A" || token == "R" || token == "ROT") return Axis::A;
  if (token == "ALL" || token == "TODOS") return Axis::ALL;
  return Axis::UNKNOWN;
}

uint16_t clampRpm(int32_t rpm) {
  rpm = abs(rpm);
  if (rpm > MAX_RPM) rpm = MAX_RPM;
  return static_cast<uint16_t>(rpm);
}

uint8_t clampAcc(int32_t acc) {
  if (acc < 0) return 0;
  if (acc > MAX_ACC) return MAX_ACC;
  return static_cast<uint8_t>(acc);
}

int32_t mmToEncoderCounts(float mm) {
  const float counts = mm * ENCODER_COUNTS_PER_MM;
  if (counts > MAX_INT24) return MAX_INT24;
  if (counts < MIN_INT24) return MIN_INT24;
  return static_cast<int32_t>(roundf(counts));
}

int32_t degToEncoderCounts(float deg) {
  const float counts = deg * ENCODER_COUNTS_PER_DEG;
  if (counts > MAX_INT24) return MAX_INT24;
  if (counts < MIN_INT24) return MIN_INT24;
  return static_cast<int32_t>(roundf(counts));
}

float encoderCountsToMm(int64_t encoderCounts) {
  return static_cast<float>(encoderCounts) / ENCODER_COUNTS_PER_MM;
}

float encoderCountsToDeg(int64_t encoderCounts) {
  return static_cast<float>(encoderCounts) / ENCODER_COUNTS_PER_DEG;
}

float encoderCountsToRad(int64_t encoderCounts) {
  return encoderCountsToDeg(encoderCounts) * PI / 180.0f;
}

float motorPositionUnits(const MotorNode &motor) {
  return motor.rotaryAxis ? encoderCountsToDeg(motor.encoder) : encoderCountsToMm(motor.encoder);
}

float motorVelocityUnitsPerS(const MotorNode &motor) {
  return motor.velocityMmS;
}

float motorJointPosition(const MotorNode &motor) {
  return motor.rotaryAxis ? encoderCountsToRad(motor.encoder) : encoderCountsToMm(motor.encoder) / 1000.0f;
}

