linuxhelp01/Esp32_paletizador/src/machine.cpp
static bool commandSyncTrigger() {
  if (!mks::waitTxIdle(10)) return false;
  const uint8_t cmd[] = {mks::CMD_SYNC_TRIGGER};
  bool ok = true;
  for (uint8_t i = 0; i < 3; i++) {
    ok &= sendDriverCommand(mks::CAN_ID_BROADCAST, cmd, sizeof(cmd));
    delay(1);
  }
  return ok;
}

static bool commandPrepareSynchronizedMove() {
  pauseEncoderPolling();
  drainCanReplies();
  const bool idle = mks::waitTxIdle(10);
  const bool ok = idle && commandEnableSyncBroadcast(true);
  delay(2);
  return ok;
}

static bool commandAbsolutePosition(MotorNode &motor, int32_t encoderTarget, uint16_t rpm, uint8_t acc) {
  if (!motorIsCommandable(motor)) return false;

  encoderTarget = toMotorTarget(motor, encoderTarget);
  if (encoderTarget < MIN_INT24) encoderTarget = MIN_INT24;
  if (encoderTarget > MAX_INT24) encoderTarget = MAX_INT24;

  const uint32_t coord24 = static_cast<uint32_t>(encoderTarget) & 0x00FFFFFF;
  const uint8_t cmd[] = {
    mks::CMD_RUN_ABS_COORD,
    static_cast<uint8_t>((rpm >> 8) & 0xFF),
    static_cast<uint8_t>(rpm & 0xFF),
    acc,
    static_cast<uint8_t>((coord24 >> 16) & 0xFF),
    static_cast<uint8_t>((coord24 >> 8) & 0xFF),
    static_cast<uint8_t>(coord24 & 0xFF),
  };

  const bool ok = sendDriverCommand(motor.canId, cmd, sizeof(cmd));
  if (ok) motor.lastAcc = acc;
  return ok;
}

bool commandMoveXYZAMmDeg(
    float xMm,
    float yMm,
    float zMm,
    bool useA,
    float aDeg,
    float speedMmS,
    float accelMmS2,
    float angularSpeedDegS,
    float angularAccelDegS2) {
  const int32_t xTarget = mmToEncoderCounts(xMm);
  const int32_t yTarget = mmToEncoderCounts(yMm);
  const int32_t zTarget = mmToEncoderCounts(zMm);
  const int32_t aTarget = degToEncoderCounts(aDeg);
  const uint16_t linearRpm = speedMmS > 0.0f ? linearSpeedMmSToRpm(speedMmS) : DEFAULT_RPM;
  const uint8_t linearAcc = accelMmS2 > 0.0f ? linearAccelMmS2ToMksAcc(accelMmS2) : DEFAULT_ACC;
  const uint16_t angularRpm = angularSpeedDegS > 0.0f ? angularSpeedDegSToRpm(angularSpeedDegS) : DEFAULT_RPM;
  const uint8_t angularAcc = angularAccelDegS2 > 0.0f ? angularAccelDegS2ToMksAcc(angularAccelDegS2) : DEFAULT_ACC;

  if (!safetyAllowsMotion() || !isXPairAligned()) return false;
  if (homing.active) return false;
  if (!axisIsEnabledAndClear(Axis::ALL)) return false;
  if (useA && !axisIsEnabledAndClear(Axis::A)) return false;
  if (!xyzWithinSoftwareLimits(xMm, yMm, zMm)) return false;

  setXPairExpectedDirectionFromTarget(xTarget);
  bool ok = commandPrepareSynchronizedMove();
  ok &= commandAbsolutePosition(motors[0], xTarget, linearRpm, linearAcc);
  ok &= commandAbsolutePosition(motors[1], xTarget, linearRpm, linearAcc);
  ok &= commandAbsolutePosition(motors[2], yTarget, linearRpm, linearAcc);
  ok &= commandAbsolutePosition(motors[3], zTarget, linearRpm, linearAcc);
  if (useA) ok &= commandAbsolutePosition(motors[4], aTarget, angularRpm, angularAcc);
  if (ok) ok &= commandSyncTrigger();
  if (!ok) {
    xPairMotionMonitoringActive = false;
    xPairExpectedDirection = 0;
  }
  return ok;
}

bool commandMoveXYZMm(float xMm, float yMm, float zMm, float speedMmS, float accelMmS2) {
  return commandMoveXYZAMmDeg(xMm, yMm, zMm, false, 0.0f, speedMmS, accelMmS2, 0.0f, 0.0f);
}

static bool requestEncoder(const MotorNode &motor) {
  const uint8_t cmd[] = {mks::CMD_READ_ENCODER};
  return sendTelemetryRequest(motor.canId, cmd, sizeof(cmd));
}

static bool requestSpeed(const MotorNode &motor) {
  const uint8_t cmd[] = {mks::CMD_READ_SPEED_RPM};
  return sendTelemetryRequest(motor.canId, cmd, sizeof(cmd));
}

static bool requestRawEncoder(const MotorNode &motor) {
  const uint8_t cmd[] = {mks::CMD_READ_RAW_ENCODER};
  return sendTelemetryRequest(motor.canId, cmd, sizeof(cmd));
}

static bool requestAngleError(const MotorNode &motor) {
  const uint8_t cmd[] = {mks::CMD_READ_ANGLE_ERROR};
  return sendTelemetryRequest(motor.canId, cmd, sizeof(cmd));
}

static bool requestEnableStatus(const MotorNode &motor) {
  const uint8_t cmd[] = {mks::CMD_READ_ENABLE};
  return sendTelemetryRequest(motor.canId, cmd, sizeof(cmd));
}

static bool requestHomeStatus(const MotorNode &motor) {
  const uint8_t cmd[] = {mks::CMD_READ_HOME_STATUS};
  return sendTelemetryRequest(motor.canId, cmd, sizeof(cmd));
}

static bool requestStallStatus(const MotorNode &motor) {
  const uint8_t cmd[] = {mks::CMD_READ_STALL};
  return sendTelemetryRequest(motor.canId, cmd, sizeof(cmd));
}

static void handleEncoderReply(MotorNode &motor, const twai_message_t &msg) {
  if (msg.data_length_code < 8) return;

  int64_t value = 0;
  for (uint8_t i = 1; i <= 6; i++) {
    value = (value << 8) | msg.data[i];
  }
  if (value & 0x0000800000000000LL) {
    value |= 0xFFFF000000000000LL;
  }

  const uint32_t now = millis();
  if (motor.encoderOk && motor.lastEncoderUpdateMs != now) {
    const uint32_t dtMs = now - motor.lastEncoderUpdateMs;
    if (dtMs > 0) {
      const int64_t delta = (value * motor.direction) - motor.encoder;
      const float instantVelocity = (motor.rotaryAxis ? encoderCountsToDeg(delta) : encoderCountsToMm(delta)) * 1000.0f / static_cast<float>(dtMs);
      motor.velocityMmS = 0.7f * motor.velocityMmS + 0.3f * instantVelocity;
    }
  }

  motor.rawEncoder = value;
  motor.previousEncoder = motor.encoder;
  motor.encoder = value * motor.direction;
  motor.encoderOk = true;
  motor.lastEncoderUpdateMs = now;
  motor.lastSeenMs = motor.lastEncoderUpdateMs;
  verifyXPairDirectionSafety();
}

static void handleSpeedReply(MotorNode &motor, const twai_message_t &msg) {
  if (msg.data_length_code < 4) return;

  const int16_t rawRpm = static_cast<int16_t>((static_cast<uint16_t>(msg.data[1]) << 8) | msg.data[2]);
  motor.rpm = rawRpm * motor.direction;
  motor.rpmOk = true;
  motor.lastSeenMs = millis();
}

static void handleRawEncoderReply(MotorNode &motor, const twai_message_t &msg) {
  if (msg.data_length_code < 8) return;

  int64_t value = 0;
  for (uint8_t i = 1; i <= 6; i++) {
    value = (value << 8) | msg.data[i];
  }
  if (value & 0x0000800000000000LL) {
    value |= 0xFFFF000000000000LL;
  }

