linuxhelp01/Esp32_paletizador/src/machine.cpp
  motor.diagnosticRawEncoder = value * motor.direction;
  motor.rawEncoderOk = true;
  motor.lastRawEncoderUpdateMs = millis();
  motor.lastSeenMs = motor.lastRawEncoderUpdateMs;
}

static void handleAngleErrorReply(MotorNode &motor, const twai_message_t &msg) {
  if (msg.data_length_code >= 6) {
    motor.angleError =
        (static_cast<int32_t>(msg.data[1]) << 24) |
        (static_cast<int32_t>(msg.data[2]) << 16) |
        (static_cast<int32_t>(msg.data[3]) << 8) |
        static_cast<int32_t>(msg.data[4]);
  } else if (msg.data_length_code >= 4) {
    motor.angleError = static_cast<int16_t>((static_cast<uint16_t>(msg.data[1]) << 8) | msg.data[2]);
  } else {
    return;
  }
  motor.angleErrorOk = true;
  motor.lastSeenMs = millis();
}

static void handleEnableReply(MotorNode &motor, const twai_message_t &msg) {
  if (msg.data_length_code < 3) return;
  motor.enabled = msg.data[1] != 0;
  motor.enabledOk = true;
  motor.lastSeenMs = millis();
}

static void handleHomeStatusReply(MotorNode &motor, const twai_message_t &msg) {
  if (msg.data_length_code < 4) return;
  motor.homeStatusSingleTurn = msg.data[1];
  motor.homeStatusOrigin = msg.data[2];
  motor.homeStatusOk = true;
  motor.lastSeenMs = millis();
}

static void handleStallReply(MotorNode &motor, const twai_message_t &msg) {
  if (msg.data_length_code < 3) return;
  motor.stalled = msg.data[1] != 0;
  motor.stallOk = true;
  motor.lastSeenMs = millis();
}

static void handleStatusReply(MotorNode &motor, const twai_message_t &msg) {
  if (msg.data_length_code < 3) return;
  const uint8_t code = msg.data[0];
  const uint8_t status = msg.data[1];

  if (code == mks::CMD_HOME) {
    motor.homeStatus = status;
    motor.homeCommandOk = true;
  } else if (code == mks::CMD_SET_ENABLE) {
    motor.enableCommandStatus = status;
    if (status == 1) {
      motor.enabledOk = false;
    }
  } else if (code == mks::CMD_RUN_ABS_COORD || code == mks::CMD_RUN_SPEED || code == mks::CMD_EMERGENCY_STOP) {
    motor.moveStatus = status;
  }
  motor.lastSeenMs = millis();
}

void drainCanReplies() {
  twai_message_t rx = {};
  while (mks::readAnyFrame(rx, 0)) {
    MotorNode *motor = findMotorById(rx.identifier);
    if (!motor) continue;
    if (!mks::verifyChecksum(rx)) continue;

    switch (rx.data[0]) {
      case mks::CMD_READ_ENCODER:
        handleEncoderReply(*motor, rx);
        break;
      case mks::CMD_READ_SPEED_RPM:
        handleSpeedReply(*motor, rx);
        break;
      case mks::CMD_READ_RAW_ENCODER:
        handleRawEncoderReply(*motor, rx);
        break;
      case mks::CMD_READ_ANGLE_ERROR:
        handleAngleErrorReply(*motor, rx);
        break;
      case mks::CMD_READ_ENABLE:
        handleEnableReply(*motor, rx);
        break;
      case mks::CMD_READ_HOME_STATUS:
        handleHomeStatusReply(*motor, rx);
        break;
      case mks::CMD_READ_STALL:
        handleStallReply(*motor, rx);
        break;
      case mks::CMD_RUN_ABS_COORD:
      case mks::CMD_RUN_SPEED:
      case mks::CMD_EMERGENCY_STOP:
      case mks::CMD_HOME:
      case mks::CMD_SET_ZERO:
      case mks::CMD_SET_MODE:
      case mks::CMD_SET_ENABLE:
      case mks::CMD_SET_HOME_PARAMS:
      case mks::CMD_RELEASE_STALL:
        handleStatusReply(*motor, rx);
        break;
      default:
        motor->lastSeenMs = millis();
        break;
    }
  }
}

void pollEncoders() {
  const uint32_t now = millis();
  if (static_cast<int32_t>(now - encoderPollingPausedUntilMs) < 0) return;

  if (now - lastEncoderPollMs >= ENCODER_POLL_MS) {
    lastEncoderPollMs = now;
    for (uint8_t i = 0; i < ENCODER_REQUESTS_PER_POLL; i++) {
      requestEncoder(motors[nextEncoderPollMotor]);
      nextEncoderPollMotor = (nextEncoderPollMotor + 1) % ROBOT_MOTOR_COUNT;
    }
  }

  if (now - lastSpeedPollMs >= SPEED_POLL_MS) {
    lastSpeedPollMs = now;
    requestSpeed(motors[nextSpeedPollMotor]);
    nextSpeedPollMotor = (nextSpeedPollMotor + 1) % ROBOT_MOTOR_COUNT;
  }

  if (homing.active && now - lastHomeStatusPollMs >= HOME_STATUS_POLL_MS) {
    lastHomeStatusPollMs = now;
    const Axis axis = currentHomingAxis();
    forEachMotorInAxis(axis, [](MotorNode &motor) {
      requestHomeStatus(motor);
      return true;
    });
  }

  if (!homing.active && now - lastRawEncoderPollMs >= RAW_ENCODER_DIAGNOSTIC_POLL_MS) {
    lastRawEncoderPollMs = now;
    requestRawEncoder(motors[nextRawEncoderPollMotor]);
    nextRawEncoderPollMotor = (nextRawEncoderPollMotor + 1) % ROBOT_MOTOR_COUNT;
  }

  if (now - lastAngleErrorPollMs >= ANGLE_ERROR_POLL_MS) {
    lastAngleErrorPollMs = now;
    requestAngleError(motors[nextAngleErrorPollMotor]);
    nextAngleErrorPollMotor = (nextAngleErrorPollMotor + 1) % ROBOT_MOTOR_COUNT;
  }

  if (now - lastEnableStatusPollMs >= ENABLE_STATUS_POLL_MS) {
    lastEnableStatusPollMs = now;
    requestEnableStatus(motors[nextEnablePollMotor]);
    nextEnablePollMotor = (nextEnablePollMotor + 1) % ROBOT_MOTOR_COUNT;
  }

  if (now - lastStallStatusPollMs >= STALL_STATUS_POLL_MS) {
    lastStallStatusPollMs = now;
    requestStallStatus(motors[nextStallPollMotor]);
    nextStallPollMotor = (nextStallPollMotor + 1) % ROBOT_MOTOR_COUNT;
  }
}

void serviceMachine() {
  if (!homing.active) return;

  const uint32_t now = millis();
  const Axis axis = currentHomingAxis();
  if (axis == Axis::UNKNOWN) {
    failHoming("axis");
    return;
  }

  if (homing.phase != HomingPhase::CONFIG_FAST &&
      homing.phase != HomingPhase::START_FAST &&
      homing.phase != HomingPhase::CONFIG_SLOW &&
      homing.phase != HomingPhase::START_SLOW &&
      now - homing.phaseStartedMs > HOME_PHASE_TIMEOUT_MS) {
    failHoming("timeout");
    return;
  }

  if (homingAxisHasFailure(axis)) {
    failHoming("driver");
    return;
  }

  switch (homing.phase) {
    case HomingPhase::CONFIG_FAST:
      {
        const uint16_t rpm = homing.fastRpm;
        if (!forEachMotorInAxis(axis, [rpm](MotorNode &motor) {
              return commandConfigureHome(motor, rpm);
            })) {
          failHoming("cfg_fast");
          return;
        }
      }
      homing.phase = HomingPhase::START_FAST;
      homing.phaseStartedMs = now;
      setHomingText("start_fast", axis);
      break;

    case HomingPhase::START_FAST:
      if (!forEachMotorInAxis(axis, [](MotorNode &motor) {
            return commandHome(motor);
          })) {
        failHoming("home_fast");
        return;
      }
      homing.phase = HomingPhase::WAIT_FAST;
      homing.phaseStartedMs = now;
      setHomingText("wait_fast", axis);
      break;

