linuxhelp01/Esp32_paletizador/src/machine.cpp
    case HomingPhase::WAIT_FAST:
      if (homingAxisIsComplete(axis)) {
        homing.phase = HomingPhase::CONFIG_SLOW;
        homing.phaseStartedMs = now;
        setHomingText("config_slow", axis);
      }
      break;

    case HomingPhase::CONFIG_SLOW:
      {
        const uint16_t rpm = homing.slowRpm;
        if (!forEachMotorInAxis(axis, [rpm](MotorNode &motor) {
              return commandConfigureHome(motor, rpm);
            })) {
          failHoming("cfg_slow");
          return;
        }
      }
      homing.phase = HomingPhase::START_SLOW;
      homing.phaseStartedMs = now;
      setHomingText("start_slow", axis);
      break;

    case HomingPhase::START_SLOW:
      if (!forEachMotorInAxis(axis, [](MotorNode &motor) {
            return commandHome(motor);
          })) {
        failHoming("home_slow");
        return;
      }
      homing.phase = HomingPhase::WAIT_SLOW;
      homing.phaseStartedMs = now;
      setHomingText("wait_slow", axis);
      break;

    case HomingPhase::WAIT_SLOW:
      if (homingAxisIsComplete(axis)) {
        finishCurrentHomingAxis();
      }
      break;

    default:
      break;
  }
}

bool homingIsActive() {
  return homing.active;
}

const char *homingStateText() {
  return homing.stateText;
}

void printHelp() {
  DebugSerial.println();
  DebugSerial.println("Comandos:");
  DebugSerial.println("  HELLO");
  DebugSerial.println("  POS <X|Y|Z|A> <encoder_abs> [rpm] [acc]");
  DebugSerial.println("      Posicion angular absoluta del motor en cuentas de encoder.");
  DebugSerial.println("  POSANG <X|Y|Z|A> <encoder_abs> [rpm] [rpm_s]");
  DebugSerial.println("      Posicion angular. En X mueve X1/X2 juntos.");
  DebugSerial.println("  POSMM <X|Y|Z> <mm_abs> [rpm] [acc]");
  DebugSerial.println("      Posicion lineal absoluta del extremo del robot en milimetros.");
  DebugSerial.println("  POSLINE <X|Y|Z> <mm_abs> [mm_s] [mm_s2]");
  DebugSerial.println("      Eje del robot: posicion, velocidad y aceleracion lineal.");
  DebugSerial.println("  POSXYZ <x_mm> <y_mm> <z_mm> [mm_s] [mm_s2]");
  DebugSerial.println("      Movimiento lineal coordinado XYZ con disparo broadcast 4Bh.");
  DebugSerial.println("  SYNC <0|1>         (configura marca sincronizada MKS 4Ah por broadcast)");
  DebugSerial.println("  TRIGGER            (disparo sincronizado MKS 4Bh por broadcast)");
  DebugSerial.println("  VEL <X|Y|Z|A> <rpm> [acc]");
  DebugSerial.println("  VELANG <X|Y|Z|A> <rpm> [rpm_s]");
  DebugSerial.println("  HOME <X|Y|Z|A|ALL> [min_mm max_mm] [fast_rpm slow_rpm]");
  DebugSerial.println("      0x91 0x00 doble pasada: rapida y luego lenta.");
  DebugSerial.println("  ORIGIN <X|Y|Z|A|ALL>");
  DebugSerial.println("      0x91 0x01: vuelve al origen de coordenadas ya definido.");
  DebugSerial.println("  ZERO <X|Y|Z> <min_mm> <max_mm>");
  DebugSerial.println("      0x92: define cero actual y limites de software del eje.");
  DebugSerial.println("  ENABLE <X|Y|Z|A|ALL>");
  DebugSerial.println("  DISABLE <X|Y|Z|A|ALL>");
  DebugSerial.println("  SERVO <deg|OFF>     (servo PWM auxiliar por angulo 0..180)");
  DebugSerial.println("  SERVO_US <us>       (servo PWM auxiliar por pulso en microsegundos)");
  DebugSerial.println("  PING              (fuerza consulta CAN a todos los motores)");
  DebugSerial.println("  STOP");
  DebugSerial.println("  FAULT STATUS      (muestra el estado de seguridad)");
  DebugSerial.println("  FAULT RESET       (libera falla si X1/X2 tienen encoder valido y estan alineados)");
  DebugSerial.println("  FAULT TEST        (simula falla del eje X doble para probar enclavamiento)");
  DebugSerial.println("  STATUS");
  DebugSerial.println();
}

void printStatus() {
  DebugSerial.println("STATUS");
  DebugSerial.print("  safetyFault=");
  DebugSerial.print(safetyFaultActive ? 1 : 0);
  DebugSerial.print(" reason=");
  DebugSerial.println(safetyFaultReason);
  DebugSerial.print("  homing=");
  DebugSerial.println(homing.stateText);
  for (Axis axis : {Axis::X, Axis::Y, Axis::Z}) {
    const int8_t index = axisLimitIndex(axis);
    DebugSerial.print("  limit ");
    DebugSerial.print(axisName(axis));
    DebugSerial.print(" configured=");
    DebugSerial.print(axisLimits[index].configured ? 1 : 0);
    DebugSerial.print(" min=");
    DebugSerial.print(axisLimits[index].minMm, 3);
    DebugSerial.print(" max=");
    DebugSerial.println(axisLimits[index].maxMm, 3);
  }
  const uint32_t now = millis();
  for (const MotorNode &motor : motors) {
    const bool online = motorIsOnline(motor, now);
    DebugSerial.print("  ");
    DebugSerial.print(motor.name);
    DebugSerial.print(" id=0x");
    DebugSerial.print(motor.canId, HEX);
    DebugSerial.print(" online=");
    DebugSerial.print(online ? 1 : 0);
    DebugSerial.print(" enabled=");
    if (motor.enabledOk) DebugSerial.print(motor.enabled ? 1 : 0);
    else DebugSerial.print("?");
    DebugSerial.print(" stalled=");
    if (motor.stallOk) DebugSerial.print(motor.stalled ? 1 : 0);
    else DebugSerial.print("?");
    DebugSerial.print(" angularEnc=");
    if (motor.encoderOk) DebugSerial.print(motor.encoder);
    else DebugSerial.print("?");
    DebugSerial.print(" pos=");
    if (motor.encoderOk) DebugSerial.print(motorPositionUnits(motor), 3);
    else DebugSerial.print("?");
    DebugSerial.print(" rpm=");
    if (motor.rpmOk) DebugSerial.print(motor.rpm);
    else DebugSerial.print("?");
    DebugSerial.print(" vel=");
    if (motor.encoderOk) DebugSerial.print(motor.velocityMmS, 3);
    else DebugSerial.print("?");
    DebugSerial.print(" angleErr=");
    if (motor.angleErrorOk) DebugSerial.print(motor.angleError);
    else DebugSerial.print("?");
    DebugSerial.print(" acc=");
    DebugSerial.print(motor.lastAcc);
    DebugSerial.print(" moveStatus=");
    DebugSerial.print(motor.moveStatus);
    DebugSerial.print(" home91=");
    DebugSerial.print(motor.homeStatus);
    DebugSerial.print(" home3B=[");
    if (motor.homeStatusOk) {
      DebugSerial.print(motor.homeStatusSingleTurn);
      DebugSerial.print(",");
      DebugSerial.print(motor.homeStatusOrigin);
    } else {
      DebugSerial.print("?,?");
    }
    DebugSerial.print("]");
    DebugSerial.print(" last=");
    DebugSerial.print(motor.lastSeenMs);
    DebugSerial.print(" raw31=");
    if (motor.encoderOk) DebugSerial.print(motor.rawEncoder);
    else DebugSerial.print("?");
    DebugSerial.print(" raw35=");
    if (motor.rawEncoderOk) DebugSerial.println(motor.diagnosticRawEncoder);
    else DebugSerial.println("?");
  }
  DebugSerial.print("  auxServo enabled=");
  DebugSerial.print(auxServoEnabled ? 1 : 0);
  DebugSerial.print(" pulseUs=");
  DebugSerial.print(auxServoPulseUs);
  DebugSerial.print(" angleDeg=");
  DebugSerial.println(auxServoAngleDeg, 1);
}

static uint32_t auxServoDutyFromPulseUs(uint16_t pulseUs) {
  const uint32_t maxDuty = (1UL << AUX_SERVO_PWM_RES_BITS) - 1UL;
  return static_cast<uint32_t>((static_cast<uint64_t>(pulseUs) * maxDuty) / 20000ULL);
}

