linuxhelp01/Esp32_paletizador/src/machine.cpp
  if (command == "POSANG") {
    Axis axis = parseAxis(nextToken(line));
    int32_t target = nextToken(line).toInt();
    uint16_t rpm = line.length() ? clampRpm(nextToken(line).toInt()) : DEFAULT_RPM;
    uint8_t acc = line.length() ? angularAccelRpmSToMksAcc(nextToken(line).toFloat()) : DEFAULT_ACC;
    if (!axisIsSafeForMotion(axis)) {
      reportCommandResult("POSANG", false);
      return;
    }

    if (axis == Axis::X) setXPairExpectedDirectionFromTarget(target);
    bool ok = commandPrepareSynchronizedMove();
    ok &= forEachMotorInAxis(axis, [target, rpm, acc](MotorNode &motor) {
      return commandAbsolutePosition(motor, target, rpm, acc);
    });
    if (ok) ok &= commandSyncTrigger();
    if (!ok) clearXPairExpectedDirectionIfAxis(axis);
    reportCommandResult("POSANG", ok);
    return;
  }

  if (command == "POSMM") {
    Axis axis = parseAxis(nextToken(line));
    const float targetMm = nextToken(line).toFloat();
    int32_t target = mmToEncoderCounts(targetMm);
    uint16_t rpm = line.length() ? clampRpm(nextToken(line).toInt()) : DEFAULT_RPM;
    uint8_t acc = line.length() ? clampAcc(nextToken(line).toInt()) : DEFAULT_ACC;
    if (!axisIsSafeForMotion(axis) || !targetWithinSoftwareLimits(axis, targetMm) || homing.active) {
      reportCommandResult("POSMM", false);
      return;
    }

    if (axis == Axis::X) setXPairExpectedDirectionFromTarget(target);
    bool ok = commandPrepareSynchronizedMove();
    ok &= forEachMotorInAxis(axis, [target, rpm, acc](MotorNode &motor) {
      return commandAbsolutePosition(motor, target, rpm, acc);
    });
    if (ok) ok &= commandSyncTrigger();
    if (!ok) clearXPairExpectedDirectionIfAxis(axis);
    reportCommandResult("POSMM", ok);
    return;
  }

  if (command == "POSLINE") {
    Axis axis = parseAxis(nextToken(line));
    const float targetMm = nextToken(line).toFloat();
    int32_t target = mmToEncoderCounts(targetMm);
    uint16_t rpm = line.length() ? linearSpeedMmSToRpm(nextToken(line).toFloat()) : DEFAULT_RPM;
    uint8_t acc = line.length() ? linearAccelMmS2ToMksAcc(nextToken(line).toFloat()) : DEFAULT_ACC;
    if (!axisIsSafeForMotion(axis) || !targetWithinSoftwareLimits(axis, targetMm) || homing.active) {
      reportCommandResult("POSLINE", false);
      return;
    }

    if (axis == Axis::X) setXPairExpectedDirectionFromTarget(target);
    bool ok = commandPrepareSynchronizedMove();
    ok &= forEachMotorInAxis(axis, [target, rpm, acc](MotorNode &motor) {
      return commandAbsolutePosition(motor, target, rpm, acc);
    });
    if (ok) ok &= commandSyncTrigger();
    if (!ok) clearXPairExpectedDirectionIfAxis(axis);
    reportCommandResult("POSLINE", ok);
    return;
  }

  if (command == "POSXYZ") {
    const float xMm = nextToken(line).toFloat();
    const float yMm = nextToken(line).toFloat();
    const float zMm = nextToken(line).toFloat();
    const float speedMmS = line.length() ? nextToken(line).toFloat() : 0.0f;
    const float accelMmS2 = line.length() ? nextToken(line).toFloat() : 0.0f;
    const bool ok = commandMoveXYZMm(xMm, yMm, zMm, speedMmS, accelMmS2);
    reportCommandResult("POSXYZ", ok);
    return;
  }

  if (command == "SERVO") {
    String value = nextToken(line);
    value.toUpperCase();
    if (value == "OFF" || value == "0FF") {
      reportCommandResult("SERVO", commandDisableAuxServo());
      return;
    }
    reportCommandResult("SERVO", commandSetAuxServoAngle(value.toFloat()));
    return;
  }

  if (command == "SERVO_US") {
    const uint16_t pulseUs = static_cast<uint16_t>(nextToken(line).toInt());
    reportCommandResult("SERVO_US", commandSetAuxServoPulseUs(pulseUs));
    return;
  }

  if (command == "HOME") {
    Axis axis = parseAxis(nextToken(line));
    bool configureLimits = false;
    float minMm = 0.0f;
    float maxMm = 0.0f;
    uint16_t fastRpm = HOME_FAST_RPM;
    uint16_t slowRpm = HOME_SLOW_RPM;
    if (line.length()) {
      minMm = nextToken(line).toFloat();
      if (line.length()) {
        maxMm = nextToken(line).toFloat();
        configureLimits = true;
      }
    }
    if (line.length()) fastRpm = clampRpm(nextToken(line).toInt());
    if (line.length()) slowRpm = clampRpm(nextToken(line).toInt());

    const bool ok = startHomeAxis(axis, configureLimits, minMm, maxMm, fastRpm, slowRpm);
    reportCommandResult("HOME", ok);
    return;
  }

  if (command == "ORIGIN") {
    Axis axis = parseAxis(nextToken(line));
    const bool ok = commandGoOriginAxis(axis);
    reportCommandResult("ORIGIN", ok);
    return;
  }

  if (command == "ZERO") {
    Axis axis = parseAxis(nextToken(line));
    const float minMm = nextToken(line).toFloat();
    const float maxMm = nextToken(line).toFloat();
    const bool ok = commandSetZeroAxis(axis, true, minMm, maxMm);
    reportCommandResult("ZERO", ok);
    return;
  }

  if (command == "ENABLE") {
    Axis axis = parseAxis(nextToken(line));
    const bool ok = commandSetAxisEnable(axis, true);
    reportCommandResult("ENABLE", ok);
    return;
  }

  if (command == "DISABLE") {
    Axis axis = parseAxis(nextToken(line));
    const bool ok = commandSetAxisEnable(axis, false);
    reportCommandResult("DISABLE", ok);
    return;
  }

  DebugSerial.print("Comando desconocido: ");
  DebugSerial.println(command);
  printHelp();
}

bool beginMachine() {
  if (!mks::begin()) return false;

#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcAttach(static_cast<uint8_t>(AUX_SERVO_PWM_PIN), AUX_SERVO_PWM_FREQ_HZ, AUX_SERVO_PWM_RES_BITS);
#else
  ledcSetup(AUX_SERVO_PWM_CHANNEL, AUX_SERVO_PWM_FREQ_HZ, AUX_SERVO_PWM_RES_BITS);
  ledcAttachPin(static_cast<uint8_t>(AUX_SERVO_PWM_PIN), AUX_SERVO_PWM_CHANNEL);
#endif
  commandSetAuxServoPulseUs(AUX_SERVO_CENTER_US);

  commandSetBusFocModeBroadcast();
  delay(20);
  commandEnableSyncBroadcast(true);
  delay(20);

  for (MotorNode &motor : motors) {
    commandSetBusFocMode(motor);
    delay(20);
    commandEmergencyStop(motor);
    delay(20);
    commandSetEnable(motor, true);
    delay(20);
    requestEnableStatus(motor);
    requestStallStatus(motor);
    requestEncoder(motor);
    delay(5);
  }

  return true;
}
